"""Звездный треугольник

Напишите программу, которая выводит указанный треугольник,
состоящий из звездочек (*).
"""

for i in range(1, 8):
    print("*" * i)
