"""Звездный прямоугольник

Напишите программу, которая выводит прямоугольник,
по периметру состоящий из звездочек (*).

Примечание. Высота и ширина прямоугольника равны 4 и 17
звёздочкам соответственно.
"""

print("*" * 17)
print("*", " " * 13, "*")
print("*", " " * 13, "*")
print("*" * 17)
